var bardz = 30;  //մատրիցի բարձրությունը
var layn = 100;  //մատրիցի երկարությունը
var grassCount = 120; //խոտերի սկզբնական քանակը մատրիցում 
var eatGrassCount = 10; //խոտակերների սկզբնական քանակը մատրիցում 
for (let y = 0; y < rows; y++) {
    matrix[y] = []; // Մատրիցի նոր տողի ստեղծում
    for (let x = 0; x < columns; x++) {
    let a = Math.floor(Math.random()*100);
    if (a >= 0 && a < 20) {
    matrix[y][x] = 0; // Մատրիցի 20 տոկոսը կլինի 0
    } 
    if (a >= 20 && a < 40) {
    matrix[y][x] = 1; // Մատրիցի 20 տոկոսը կլինի 1
    } 
    else if (a >= 40 && a < 50) {
    matrix[y][x] = 2; // Մատրիցի 10 տոկոսը կլինի 2
    } 
    else if (a >= 50 && a < 70) {
    matrix[y][x] = 3; // Մատրիցի 20 տոկոսը կլինի 3
    } 
    else if(a >= 70 && a < 90) {
    matrix[y][x] = 4; // Մատրիցի 20 տոկոսը կլինի 4
    } 
    else if(a >= 90 && a < 100) {
    matrix[y][x] = 5; // Մատրիցի 10 տոկոսը կլինի 5
    } 
    }
    }


